{
    "initial_messages": [
        "Ready to flex those coding muscles? Your next challenge awaits:",
        "Time to level up your skills! Today's problem is calling your name:",
        "Hey coding champ, here's your daily brain teaser:",
        "Procrastination is the thief of code. Let's tackle this problem:",
        "Another day, another chance to become a better coder. Your mission:",
        "The path to coding mastery is paved with solved problems. Here's your next step:",
        "Coffee brewed? Fingers limbered? Let's crush this problem:",
        "Coding is like a gym for your brain. Time for your daily workout:",
        "Challenge accepted? Your next coding puzzle awaits:",
        "Sharpen your algorithmic sword with today's problem:",
        "Debugging is twice as hard as writing the code. Are you up for it?",
        "Every problem solved is a step towards your dream job. Ready for this one?",
        "Code, debug, optimize, repeat. Your next iteration starts with:",
        "Great coders are made, not born. Let's build your skills with:",
        "Your future self will thank you for solving this problem:",
        "Stuck in a coding rut? Break free with this challenge:",
        "Coding is poetry. Time to write your next masterpiece:",
        "Remember, every expert was once a beginner. Your next lesson:",
        "Unleash your inner coding ninja on this problem:",
        "The best way to predict the future is to code it. Start with:"
    ],
    "reminder_messages": [
        "That problem isn't going to solve itself...",
        "Still waiting for your solution to:",
        "Haven't seen your submission yet. No pressure, but:",
        "This problem misses you. Come back to:",
        "Your code editor is getting lonely without:",
        "Taking your time, huh? The problem is still here:",
        "Friendly reminder about your pending problem:",
        "Your LeetCode streak is at stake with:",
        "When you're ready, this problem is waiting:",
        "No rush, but this problem would love some attention:",
        "⏰ Time's ticking on this one:",
        "Still pending in your queue:",
        "This problem won't solve itself, you know:",
        "Hey, remember me? Still waiting on:",
        "Your daily challenge is feeling neglected:",
        "Don't leave this problem hanging:",
        "Clock's ticking... Time to tackle:",
        "Still on your to-do list:",
        "Not solved yet? Let's change that:",
        "Your brain needs this exercise:",
        "Kya kar rha hai bhai, khtm kar na:",
        "Just. Do. It. 💪",
        "Running out of excuses for not solving:",
        "Your future self is judging you for postponing:",
        "The problem: unsolved. You: procrastinating. The solution:",
        "Stop scrolling social media and solve:",
        "Netflix can wait. This problem can't:",
        "Are we doing this today or what?",
        "Your keyboard misses you. Come back to:",
        "Procrastination level: Expert. Time to change that with:",
        "Last reminder of the day for:",
        "It's now or never for:",
        "Don't let this problem haunt your dreams:",
        "Still here, still unsolved:",
        "One more chance to be awesome today:",
        "The solution isn't going to write itself:",
        "Your daily challenge is crying in the corner:",
        "Time to stop avoiding:",
        "Final call for today's problem:",
        "Close your other tabs and focus on:"
    ],
    "congrats_messages": [
        "🎉 Incredible work! You've conquered:",
        "👏 Success tastes sweet! Great job solving:",
        "🚀 Look at you go! Excellent work on:",
        "💪 Victory is yours! You've mastered:",
        "🏆 Mission accomplished! You crushed:",
        "⭐ Brilliant solution for:",
        "🌟 Your hard work paid off! Congrats on solving:",
        "🎯 Bull's eye! Perfect solution for:",
        "🔥 You're on fire! Amazing work with:",
        "🎊 Another problem bites the dust! Well done on:"
    ]
}
